import 'dart:html';
const areas_rows_count=8;
Storage local_storage;
String store_string;
String depot_string;
String product_string;
String owner_name;
String product_name;
DivElement top;
ButtonElement product;
DivElement store_take_stock_view;
ButtonElement store_take_stock_product_view;
DivElement store_take_stock_num_view;

DivElement store_areas_open_view;
DivElement store_areas_view;

List<List<DivElement>> divs;
List<String> divs_display;
Map<String,Map<String,int>> owners_product;

void main() {
  local_storage = window.localStorage;
  product_string=local_storage["产品"];
  if (product_string == null) {
  product_string='''丙烯克洛特
荧光妃红 8
荧光桃红 8
朱红 8
玫瑰红 8
大红 8
深红 8
橙色 8
那波里黄 8
土黄 8
柠檬黄 8
中黄 8
起司 8
香水百合 8
青莲 8
普蓝 8
湖蓝 8
酞菁蓝 8
国美兰 8
钴蓝 8
天蓝 8
熟褐 8
宝石翠绿 8
橄榄绿 8
粉绿 8
酞菁绿 8
浅绿 8
黄绿 8
熟赭 8
银色 8
淡紫 8
黑色 8
钛白 8

丙烯温莎120
柠檬黄 6
中黄 6
深黄 6
橙色 6
肉色 6
大红 6
深红 6
玫红 6
玫瑰莤红 6
青莲 6
酞菁蓝 6
群青 6
湖蓝 6
天蓝 6
钴蓝 6
普兰 6
粉绿 6
浅绿 6
沙普绿 6
氧化铬绿 6
宝石翠绿 6
土黄 6
熟赭 6
熟褐 6
生褐 6
中灰 6
马斯黑 6
钛白 6

丙烯温莎22
柠檬黄 8
浅柠檬黄 8
中黄 8
深黄 8
桔黄 8
桔红 8
橙色 8
肉色 8
朱红 8
大红 8
永固红 8
深红 8
玫红 8
玫瑰茜红 8
青莲 8
淡紫 8
紫色 8
酞菁蓝 8
群青 8
湖蓝 8
天蓝 8
浅灰蓝 8
钴蓝 8
普蓝 8
粉绿 8
黄绿 8
浅绿 8
沙普绿 8
浅橄榄绿 8
氧化铬绿 8
宝石翠绿 8
酞菁绿 8
橄榄绿 8
深青绿 8
沙色 8
那坡里黄 8
土黄 8
浅赤土 8
土红 8
赤土色 8
熟赭 8
熟褐 8
生褐 8
中灰 8
培恩灰 8
象牙黑 8
马斯黑 8
钛白 8
锌白 8
金色 8
铜色 8
青铜色 8
银色 8
荧光黄 8
荧光桔黄 8
荧光粉红 8
荧光桃红 8
荧光绿 8
荧光蓝 8

丙烯温莎300
柠檬黄 4
浅柠檬黄 4
中黄 4
深黄 4
桔黄 4
桔红 4
橙色 4
肉色 4
朱红 4
大红 4
永固红 4
深红 4
玫红 4
玫瑰茜红 4
青莲 4
淡紫 4
紫色 4
酞菁蓝 4
群青 4
湖蓝 4
天蓝 4
浅灰蓝 4
钴蓝 4
普蓝 4
粉绿 4
黄绿 4
浅绿 4
沙普绿 4
浅橄榄绿 4
氧化铬绿 4
宝石翠绿 4
酞菁绿 4
橄榄绿 4
深青绿 4
沙色 4
那坡里黄 4
土黄 4
浅赤土 4
土红 4
赤土色 4
熟赭 4
熟褐 4
生褐 4
中灰 4
培恩灰 4
象牙黑 4
马斯黑 8
钛白 8
锌白 4
金色 8
铜色 4
青铜色 4
银色 4
荧光黄 4
荧光桔黄 4
荧光粉红 4
荧光桃红 4
荧光绿 4
荧光蓝 4

丙烯温莎创意300
柠檬黄 4
中黄 4
深黄 4
大红 4
玫红 4
玫瑰莤红 4
湖蓝 4
钴蓝 4
群青 4
酞菁蓝 4
翠绿 4
中绿 4
酞菁绿 4
深绿 4
土黄 4
熟褐 4
熟赭 4
马斯黑 8
钛白 12
金色 4
亮金 4

丙烯贝碧欧波普
钛白 3
柠檬黄 3
基本黄 3
镉橙 3
朱红 3
基本红 3
群青 3
基本蓝 3
酞菁绿 3
霍克绿 3
土黄 3
熟褐 3
马斯黑 3
银色 3
金色 3
中镉黄 3
那坡里黄 3
深镉红 3
钴蓝 3
荧光黄 3

丙烯马利1100
大红 15
朱红 15
桔红 15
紫红 15
深红 15
土红 15
草绿 15
中黄 16
柠檬黄 16
淡黄 16
土黄 16
桔黄 16
中绿 16
粉绿 16
钴蓝 16
湖蓝 16
天蓝 16
紫色 16
群青 16
酞菁蓝 16
淡绿 16
生褐 16
熟褐 16
威狄克棕 16
赭石 16
生赭 16
佩恩灰 16
灰色 16
钛白 16
黑色 16
酞菁绿 16
翠绿 16

水粉克洛特果冻
红肤亮 21
红肤浅 21
红肤中 21
红肤深 21
黄肤亮 21
黄肤浅 21
黄肤中 21
黄肤深 21
棕肤亮 21
棕肤浅 21
棕肤中 21
棕肤深 21
眼白浅 21
眼白深 21
背景灰 21
背景绿 21
背景黄 21
背景蓝 21
暗部浅 21
暗部中 21
暗部深 21
补色绿 21
补色青 21
补色兰 21
补色紫 21
灰发 21
冷发 21
暖发 21
亮唇 21
黄唇 21
红唇 21
中唇 21
深唇 21
钛白 21
黑色 21
浅绿 21
黄绿 21
墨绿 21
橄榄绿 21
翠绿 21
青频绿 21
那波里黄 21
大红 21
玫瑰红 21
粉红 21
桃红 21
朱红 21
深红 21
桔红 21
土黄 21
柠檬黄 21
深黄 21
嫩黄 21
中黄 21
桔黄 21
淡黄 21
湖蓝 21
钴蓝 21
天兰 21
普兰 21
粉蓝 21
紫罗兰 21
青莲 21
灰色 21
群青 21
肉色 21
熟褐 21
赭石 21

水粉克洛特
红肤浅 20
棕肤中 20
棕肤浅 20
棕肤深 20
棕肤亮 20
红肤中 20
黄肤深 20
黄肤中 20
红肤深 20
红肤亮 20
黄肤浅 20
黄肤亮 20
青梅酿 20
枫丹白露 20
蛋壳 20
法国吉维尼 20
景德 20
釉里红 20
红灰 20
拿铁 20
塞纳灰 20
波尔多红 20
匈牙利丁香 20
苏格兰红 20
背景蓝 20
背景绿 20
眼白深 20
眼白浅 20
暗部深 20
暗部浅 20
暗部中 20
红唇 20
黄唇 20
中唇 20
亮唇 20
深唇 20
拉丁黄 20
国美黄 20
里昂 20
臧氏黄 20
那波里黄 20
黄芥 20
秋叶 20
黄灰 20
橄榄灰 20
青芥 20
焦糖绿 20
国美绿 20
高粱红 20
背景灰 20
补色青 20
补色绿 20
补色紫 20
补色蓝 20
暖发 20
冷发 20
灰发 20
黑色 20
白色 20
常青藤 20
起司 40
马尔代夫 40
爱琴海 40
香水百合 40
香苹果 40
闪电紫 20
天蓝 20
芽黄灰 20
豆沙红 20
蓝莲 20
浅蟹灰 20
灰豆绿 20
米驼 20
淡青灰 20
月灰 20
雪青 20
青二 20
青三 20
青四 20
浅灰蓝 20
莱茵灰 20
风信子 20
橙棕 20
红棕 20
蟹青 20
兰灰 20
绿灰 20
蔷薇 20
国美兰 20
普罗旺斯 40
珍珠白 20
红二 20
红三 20
红四 20
红五 20
黄五 20
黄四 20
黄三 20
黄二 20
黄一 20
青五 20
蓝一 20
浣纱 20
挪威森林 20
四叶草 20
青花 20
国美红 20
锡兰 20
粉蓝 20
红葵 20
海芋 20
英伦 20
布林 20
波斯菊 20
黄绿五 20
黄绿四 20
黄绿三 20
黄绿二 20
黄绿一 20
肉黄五 20
肉黄四 20
肉黄三 20
肉黄二 20
肉黄一 20
蓝三 20
蓝二 20
紫一 20
紫二 20
紫三 20
紫四 20
紫五 20
草绿 20
维多利亚 20
云尼拿 20
炉均釉 20
臧氏蓝 20
加勒比 20
松石 20
橙一 20
橙二 20
橙三 20
橙四 20
橙五 20
绿一 20
绿二 20
绿三 20
绿四 20
绿五 20
蓝四 20
蓝五 20

水粉文萃
大红 20
朱红 20
玫瑰红 20
粉红 20
土红 20
深红 20
桔红 20
淡黄 20
中黄 20
桔黄 20
土黄 20
紫罗兰 20
天蓝 20
钴蓝 20
湖蓝 20
深绿 20
中绿 20
桃红 20
黄绿 20
草绿 20
橄榄绿 20
翠绿 20
淡绿 20
粉绿 20
墨绿 20
普兰 20
群青 20
灰色 20
肉色 40
牙黄 40
青莲 40
赭石 48
熟褐 48
煤黑 48
柠檬黄 48
那波里黄 48
白色 48

水粉海特
春日青 12
蓝莲 24
牙黄灰 24
豆沙红 24
浅蟹灰 24
淡青灰 24
月灰 24
灰豆绿 24
米驼 24

水粉温莎
柠檬黄 17
白色 17
大红 17
桃红 17
朱红 17
深红 17
玫瑰红 17
桔红 17
桔黄 17
中黄 17
淡黄 17
土黄 17
肉色 17
浅那坡里黄 17
牙黄 17
普蓝 17
天蓝 17
群青 17
中绿 17
橄榄绿 17
翠绿 17
墨绿 17
粉绿 17
草绿 17
黄绿 17
钴蓝 17
湖蓝 17
粉蓝 17
熟赭 17
土红 17
粉红 17
洋红 17
青莲 17
熟褐 17
浅驼 17
黑色 17
桔粉 17
深蓝 17
浅草绿 17
浅绿 17
茄紫 17
淡灰 17
灰色 17
紫灰 17
中灰 17
绿灰 17
砖灰 17
粉绿灰 17
淡咖啡 17
孔雀石绿 17
雪青 17
金色 17
银色 34
豆黄灰 17
浅灰紫 34
浅灰蓝 17
浅灰绿 17
月灰 17
赤土灰 17
孔雀蓝 17
荧光桃红 17
荧光红 17
荧光桔黄 17
荧光黄 17
荧光绿 17
紫色 17

水粉贝碧欧
普蓝 20
基本蓝 20
钴蓝 20
绿松石蓝 20
天蓝 20
淡绿 20
草绿 20
珠光白 20
银色 20
金色 20
柠檬黄 20
中黄 20
淡黄 20
深黄 20
翠绿 20
橄榄绿 20
深绿 20
黄绿 20
土黄 20
钛白 20
赭石 20
橙色 20
那坡里黄 20
大红 20
基本红 20
朱红 20
玫红 20
樱紫红 20
生褐 20
熟褐 20
象牙黑 20
中灰 20
土红 20
黄灰 20
红灰 20
深红 20
粉红 20
紫罗兰 20
薰衣草紫 20
青莲 20
湖蓝 20
群青 20
蓝灰 20
绿灰 20
玫瑰灰 20
粉绿 20
淡钴紫 20
肉色 20
灰豆绿 20
牙黄灰 20
淡青灰 20
米驼 20
浅蟹灰 20
蓝莲 20
豆沙红 20
月灰 20
中绿 20
桃红 20
象牙黄 20
橙灰 20
紫灰 20
橙黄 20
珠光蓝 20

水粉青竹
玉灰 16
咖啡 16
淡咖啡 16
焦糖绿 16
灰粉绿 16
青芥 16
红灰 16
黄灰 16
云尼拿 12
爱琴海 12
普罗旺斯 12
浅灰绿 12
松石 12
炉均釉 12
深绿 12
景德 12
闪电紫 12
釉里红 12
波尔多红 12
茄紫 12
匈牙利丁香 12
国美红 12
苏格兰红 12
高粱红 12
粉红 12
墨绿 12
波斯菊 12
桃红 12
香水百合 12
桔红 12
中绿 12
橄榄绿 12
青莲 12
青竹蓝 12
钴蓝 12
天蓝 12
群青 12
翠绿 12
肉色 12

水粉马利1100
大红 16
朱红 16
桃红 16
桔红 16
土红 16
玫瑰红 16
肉色 16
柠檬黄 16
淡黄 16
中黄 16
桔黄 16
翠绿 16
墨绿 16
淡绿 16
黄绿 16
中绿 16
深绿 16
草绿 16
橄榄绿 16
钴蓝 16
湖蓝 16
黑色 16
熟褐 16
群青 16
紫色 16
天蓝 16
普蓝 16
青莲 16
金色 16
灰色 16
绿灰 16
红灰 16
浅灰 16
紫灰 16
黄灰 16
棕灰 16
蓝灰 16
橙灰 16
白色 16
土黄 16
深红 16
赭石 16

水粉马利85
白色 12
钛白 12
拿坡里黄 12
柠檬黄 12
淡黄 12
肉色 12
中黄 12
桔黄 12
大红 12
桔红 12
亮红 12
深红 12
朱红 12
印度红 12
玫瑰红 12
红灰 12
橙灰 12
曙红 12
紫罗兰 12
紫红 12
青莲 12
淡紫 12
蓝紫 12
群青 12
普蓝 12
天蓝 12
孔雀蓝 12
淡蓝 12
钴蓝 12
深钴蓝 12
湖蓝 12
东方蓝 12
深蓝 12
蓝灰 12
深群青 12
绿松石蓝 12
天青蓝 12
淡绿 12
中绿 12
氧化铬绿 12
苔藓绿 12
蓝绿 12
粉绿 12
翠绿 12
黄绿 12
草绿 12
橄榄绿 12
深绿 12
墨绿 12
绿灰 12
绿松石绿 12
生赭 12
土黄 12
土红 12
赭石 12
熟褐 12
生褐 12
深褐 12
棕灰 12
哈瓦那棕 12
灰白 12
黑灰 12
黄灰 12
玫瑰灰 12
紫灰 12
深灰 12
浅灰 12
煤黑 12
佩恩灰 12
灰色 12

水粉马利85另
白色 10
钛白 10
拿坡里黄 10
柠檬黄 10
淡黄 10
肉色 10
中黄 10
桔黄 10
大红 10
桔红 10
亮红 10
深红 10
朱红 10
印度红 10
玫瑰红 10
红灰 10
橙灰 10
曙红 10
紫罗兰 10
紫红 10
青莲 10
淡紫 10
蓝紫 10
群青 10
普蓝 10
天蓝 10
孔雀蓝 10
淡蓝 10
钴蓝 10
深钴蓝 10
湖蓝 10
东方蓝 10
深蓝 10
蓝灰 10
深群青 10
绿松石蓝 10
天青蓝 10
淡绿 10
中绿 10
氧化铬绿 10
苔藓绿 10
蓝绿 10
粉绿 10
翠绿 10
黄绿 10
草绿 10
橄榄绿 10
深绿 10
墨绿 10
绿灰 10
绿松石绿 10
生赭 10
土黄 10
土红 10
赭石 10
熟褐 10
生褐 10
深褐 10
棕灰 10
哈瓦那棕 10
灰白 10
黑灰 10
黄灰 10
玫瑰灰 10
紫灰 10
深灰 10
浅灰 10
煤黑 10
佩恩灰 10
灰色 10

水粉马利95
那坡里黄 72
淡黄 48
桔黄 48
中黄 48
土黄 48
深红 48
玫瑰红 48
大红 72
紫红 24
桔红 48
土红 48
朱红 48
草绿 48
橄榄绿 48
黄绿 48
淡绿 48
普蓝 48
湖蓝 72
淡紫 34
蓝灰 17
玫瑰灰 17
浅灰 34
深灰 17
黑灰 17
灰色 17
紫灰 17
绿灰 17
棕灰 17
橙灰 17
黄灰 17
红灰 17
肉色 34
青莲 34
生褐 17
紫色 34
群青 34
天蓝 34
钴蓝 34
中绿 34
深绿 34
墨绿 34
翠绿 34
粉绿 34
里昂 17
晴朗蓝 17
芥茉绿 17
藕灰 17
浅灰绿 17
紫丁香 17
浅绿灰 17
砖灰 17
碧蓝 17
毛蓝 17
月灰 17
匈牙利丁香 17
象牙黄 17
青苹果 17
青频白 17
紫薇色 17
浅灰蓝 17
淡咖啡 17
红高粱 17
波斯菊 17
深灰绿 17
朝霞紫 17
灰豆绿 17
蓝莲 17
酱紫 17
浅米驼 17
苏格兰红 17
芽黄 17
柿红 17
豆绿 17
咖啡 17
嫩黄 17
淡青灰 17
淡妃 17
浅蟹灰 17
浅豆沙红 17
浅天蓝 17
芽黄灰 17
灰紫 17
云尼拿 17
茄灰 17
景德 17
波尔多红 17
青灰 17
高原黄 17
玉灰 17
浅棕灰 17
爱琴海 17
马尔代夫 17
雪青 17
浅黄灰 17
蔷薇 17
氧化铬绿 17
灰白 17
亮红 17
哈瓦那棕 17
深蓝 17
东方蓝 17
浅钴蓝 17
淡蓝 17
生赭 17
蓝紫 17
深群青 17
蓝绿 17
绿松石蓝 17
绿松石绿 17
苔藓绿 17
黑色 51
白色 90
柠檬黄 90
熟褐 90
赭石 90

油画温莎170
柠檬黄 5
淡黄 5
基黄 5
中黄 5
深黄 5
黄橙 5
橙色 5
肉色 5
朱红 5
印度红 5
大红 5
洋红 5
深红 5
基红 5
紫红 5
玫瑰茜红 5
青莲 5
紫罗兰 5
群青紫 5
普蓝 5
酞青蓝 5
群青 5
湖蓝 5
基蓝 5
天蓝 5
钴蓝 5
永固浅绿 5
粉绿 5
树绿 5
中绿 5
维罗纳绿 5
宝石翠绿 5
土绿 5
橄榄绿 5
那坡里黄 5
土黄 5
生赭 5
土红 5
熟赭 5
熟褐 5
生褐 5
凡戴棕 5
培恩灰 5
中灰 5
冷灰 5
暖灰 5
棕灰 5
碳黑 5
象牙黑 5
钛白 10
锌白 5
锌钛白 5
快干白 5
金色 5
银色 5

油画温莎45
柠檬黄 8
淡黄 8
基黄 8
中黄 8
深黄 8
黄橙 8
橙色 8
肉色 8
朱红 8
印度红 8
大红 8
洋红 8
深红 8
基红 8
紫红 8
玫瑰茜红 8
青莲 8
紫罗兰 8
群青紫 8
普蓝 8
酞青蓝 8
群青 8
湖蓝 8
基蓝 8
天蓝 8
钴蓝 8
永固浅绿 8
粉绿 8
树绿 8
中绿 8
维罗纳绿 8
宝石翠绿 8
土绿 8
橄榄绿 8
那坡里黄 8
土黄 8
生赭 8
土红 8
熟赭 8
熟褐 8
生褐 8
凡戴棕 8
培恩灰 8
中灰 8
冷灰 8
暖灰 8
棕灰 8
碳黑 8
象牙黑 8
钛白 8
锌白 8
锌钛白 8
快干白 8
金色 8
银色 8

油画贝碧欧200

油画贝碧欧37

油画贝碧欧80

油画马利170
锌白 5
钛白 15
锌钛白 5
底色白 5
马利柠檬黄 5
透明黄 5
铬柠黄 5
中铬黄 5
深铬黄 5
那坡里黄 5
镉柠黄 5
镉黄 5
马利黄 5
柠檬黄 5
淡黄 5
印度黄 5
肉色 5
桔铬黄 5
镍钛黄 5
麻斯黄 5
大红 5
淡品红 5
品红 5
桔红 5
亮红 5
深红 5
镉橘红 5
朱红 5
印度红 5
镉红 5
洋红 5
玫红 5
红灰 5
橙灰 5
浅红 5
中红 5
紫罗兰 5
紫红 5
土紫 5
靛蓝 5
马利紫 5
钴紫 5
群青 5
普兰 5
天蓝 5
孔雀蓝 5
酞青蓝 5
钴蓝 5
湖蓝 5
锰蓝 5
浅孔雀蓝 5
蓝灰 5
群青紫 5
中绿 5
浅绿 5
朱砂浅绿 5
朱砂中绿 5
朱砂深绿 5
湖绿 5
丛林绿 5
浅宝石绿 5
粉绿 5
翠绿 5
黄绿 5
镉绿 5
草绿 5
橄榄绿 5
马利绿 5
深铬绿 5
绿灰 5
生赭 5
土橙 5
土绿 5
透明氧化铁橙 5
金土黄 5
土黄 5
透明铁黄 5
土红 5
透明铁红 5
赭石 5
土黄棕 5
熟褐 5
生褐 5
深褐 5
威狄克棕 5
棕灰 5
透明氧化铁棕 5
黄灰 5
紫灰 5
深灰 5
浅灰 5
中灰 5
麻斯黑 5
象牙黑 5
煤黑 5
冷灰 5
暖灰 5
佩恩灰 5

水粉米娅5号杯
湖蓝 29
桔红 29
淡黄 29
深红 29
浅绿 29
天蓝 29
大红 29
橄榄绿 29
拿坡里黄 29
玫瑰红 29
淡绿 29
赭石 29
青莲 29
钴蓝 29
白色 29
黑色 29
桔黄 29
朱红 29
柠檬黄 29
翠绿 29
土黄 29
中黄 29
群青 29
粉绿 29
粉红 29
熟褐 29
黄绿 29
灰色 29
深黄 29
肉色 29
紫罗兰 29
普兰 29
墨绿 29
焦糖绿 29
米驼 29
月灰 29
起司 29
牙黄灰 29
香苹果 29
釉里红 29
景德 29
马尔代夫 29
香水百合 29
蔷薇 29
橄榄棕 29
红灰 29
淡妃 29
橄榄灰 29
咖啡 29
国美绿 29
英伦 29
云尼拿 29
松石 29
紫薇 29
拉丁黄 29
绿松石蓝 29
桃红 29
高粱红 29
绿松石绿 29
淡紫 29
紫丁香 29
国美黄 29
国美红 29
嫩黄 29
牙黄 29
青频绿 29
国美兰 29
爱琴海 29
蟹青 29

水粉米娅8号杯
柠檬黄 82
拿坡里黄 82
天蓝 82
深红 82
普兰 82
橄榄绿 82
珍珠白 82
熟褐 82
朱红 82
淡黄 82
桔红 82
中黄 82
钛白 82
浅灰蓝 82

丙烯马利
大红 15
朱红 15
桔红 15
紫红 15
深红 15
土红 15
草绿 15
中黄 16
柠檬黄 16
淡黄 16
土黄 16
桔黄 16
中绿 16
粉绿 16
钴蓝 16
湖蓝 16
天蓝 16
紫色 16
群青 16
酞菁蓝 16
淡绿 16
生褐 16
熟褐 16
威狄克棕 16
赭石 16
生赭 16
佩恩灰 16
灰色 16
钛白 16
黑色 16
酞菁绿 16
翠绿 16

丙烯青竹
桔红 8
深红 8
朱红 8
土黄 8
淡黄 8
珠光红铜 8
熟褐 8
生褐 8
浅绿 8
翠绿 8
酞菁绿 8

丙烯贝碧欧500
钛白 3
亮白 3
钛黄 3
淡黄 3
镉柠檬黄 3
基本黄 3
中镉黄 3
深镉黄 3
镉橙 3
镉红 3
深镉红 3
喹丫啶酮猩红 3
亮基本红 3
亮粉红 3
深钴紫 3
绿松石蓝 3
镉绿 3
草绿 3
土绿 3
铬绿 3
中灰 3
淡灰 3
深灰 3
冷灰 3
暖灰 3
天蓝 3
淡群青蓝 3
钴蓝 3
蓝绿 3
普蓝 3
赭石 3
泥土红 3
生褐 3
熟褐 3
佩恩灰 3
透明朱红 3
莤草洋红 3
偶氮粉红 3
东方紫 3
深群青蓝 3
幻彩绿黄 3
幻彩蓝黑 3
淡偶氮黄 3
紫红 3
蔡洋红 3
马斯黑 3
深黑 3
荧光黄 3
荧光橙 3
荧光粉红 3
亮酞菁绿 3
那坡里黄 3
土黄 3
生赭 3
土红 3
酞菁蓝 3
酞菁宝石翠绿 3
霍克绿 3
威尼斯黄 3
威尼斯红 3
幻彩橙黄 3
幻彩红蓝 3
幻彩紫蓝 3
幻彩蓝绿 3
幻彩绿蓝 3
珠光银 3
珠光金 3
珠光金黄 3
珠光铜 3''';
  }
//  store_string=local_storage["商店"];
//  if(store_string==null){
  store_string = '''水粉区
水粉马利95.那坡里黄,水粉马利95.,水粉马利95.,水粉马利95.淡黄,水粉马利95.,水粉马利95.桔黄,水粉马利95.,水粉马利95.中黄,水粉马利95.,水粉马利95.土黄,水粉马利95.,水粉马利95.深红,水粉马利95.,水粉马利95.玫瑰红,水粉马利95.,水粉马利95.大红,水粉马利95.,水粉马利95.,水粉马利95.紫红,水粉马利95.桔红,水粉马利95.,水粉马利95.土红,水粉马利95.,水粉马利95.朱红,水粉马利95.,水粉马利95.草绿,水粉马利95.,水粉马利95.橄榄绿,水粉马利95.,水粉马利95.黄绿,水粉马利95.,水粉马利95.淡绿,水粉马利95.,水粉马利95.普蓝,水粉马利95.,水粉马利95.湖蓝,水粉马利95.,水粉马利95.,水粉青竹.玉灰,水粉青竹.咖啡,水粉青竹.淡咖啡,水粉青竹.焦糖绿,水粉青竹.灰粉绿,水粉青竹.青芥,水粉青竹.红灰,水粉青竹.黄灰,水粉克洛特果冻.红肤亮,水粉克洛特果冻.红肤浅,水粉克洛特果冻.红肤中,水粉克洛特果冻.红肤深,水粉克洛特果冻.黄肤亮,水粉克洛特果冻.黄肤浅,水粉克洛特果冻.黄肤中,水粉贝碧欧.普蓝,水粉贝碧欧.基本蓝,水粉贝碧欧.钴蓝,水粉贝碧欧.绿松石蓝,水粉贝碧欧.天蓝,水粉贝碧欧.淡绿,水粉贝碧欧.草绿,水粉贝碧欧.珠光白,水粉贝碧欧.银色,水粉贝碧欧.金色,水粉贝碧欧.柠檬黄,水粉贝碧欧.中黄,水粉贝碧欧.淡黄,水粉贝碧欧.深黄,水粉克洛特.红肤浅,水粉克洛特.棕肤中,水粉克洛特.棕肤浅,水粉克洛特.棕肤深,水粉克洛特.棕肤亮,水粉克洛特.红肤中,水粉克洛特.黄肤深,水粉克洛特.黄肤中,水粉克洛特.红肤深,水粉克洛特.红肤亮,水粉克洛特.黄肤浅,水粉克洛特.黄肤亮,水粉克洛特.青梅酿,水粉克洛特.枫丹白露,水粉克洛特.蛋壳,水粉克洛特.法国吉维尼,水粉克洛特.景德,水粉克洛特.釉里红,水粉克洛特.红灰,水粉克洛特.拿铁,水粉克洛特.塞纳灰,水粉克洛特.波尔多红,水粉克洛特.匈牙利丁香,水粉克洛特.苏格兰红,水粉米娅5号杯.湖蓝,水粉米娅5号杯.桔红,水粉米娅5号杯.淡黄,水粉米娅5号杯.深红,水粉米娅5号杯.浅绿,水粉米娅5号杯.天蓝,水粉米娅5号杯.大红,水粉米娅5号杯.橄榄绿,水粉米娅5号杯.拿坡里黄,水粉米娅5号杯.玫瑰红,水粉米娅5号杯.淡绿,水粉文萃.大红,水粉文萃.朱红,水粉文萃.玫瑰红,水粉文萃.粉红,水粉文萃.土红,水粉文萃.深红,水粉文萃.桔红,水粉文萃.淡黄,水粉文萃.,水粉马利1100.大红,水粉马利1100.朱红,水粉马利1100.桃红,水粉马利1100.桔红,水粉马利1100.土红,水粉马利1100.玫瑰红,水粉马利1100.肉色
水粉马利95.淡紫,水粉马利95.,水粉马利95.蓝灰,水粉马利95.玫瑰灰,水粉马利95.浅灰,水粉马利95.,水粉马利95.深灰,水粉马利95.黑灰,水粉马利95.灰色,水粉马利95.紫灰,水粉马利95.绿灰,水粉马利95.棕灰,水粉马利95.橙灰,水粉马利95.黄灰,水粉马利95.红灰,水粉马利95.肉色,水粉马利95.,水粉马利95.青莲,水粉马利95.,水粉马利95.生褐,水粉马利95.紫色,水粉马利95.,水粉马利95.群青,水粉马利95.,水粉马利95.天蓝,水粉马利95.,水粉马利95.钴蓝,水粉马利95.,水粉马利95.中绿,水粉马利95.,水粉马利95.深绿,水粉马利95.,水粉马利95.墨绿,水粉马利95.,水粉马利95.翠绿,水粉马利95.,水粉马利95.粉绿,水粉马利95.,水粉青竹.云尼拿,水粉青竹.爱琴海,水粉青竹.普罗旺斯,水粉青竹.浅灰绿,水粉青竹.松石,水粉青竹.炉均釉,水粉青竹.深绿,水粉青竹.景德,水粉克洛特果冻.黄肤深,水粉克洛特果冻.棕肤亮,水粉克洛特果冻.棕肤浅,水粉克洛特果冻.棕肤中,水粉克洛特果冻.棕肤深,水粉克洛特果冻.眼白浅,水粉克洛特果冻.眼白深,水粉贝碧欧.翠绿,水粉贝碧欧.橄榄绿,水粉贝碧欧.深绿,水粉贝碧欧.黄绿,水粉贝碧欧.土黄,水粉贝碧欧.钛白,水粉贝碧欧.赭石,水粉贝碧欧.橙色,水粉贝碧欧.那坡里黄,水粉贝碧欧.大红,水粉贝碧欧.基本红,水粉贝碧欧.朱红,水粉贝碧欧.玫红,水粉贝碧欧.樱紫红,水粉克洛特.背景蓝,水粉克洛特.背景绿,水粉克洛特.眼白深,水粉克洛特.眼白浅,水粉克洛特.暗部深,水粉克洛特.暗部浅,水粉克洛特.暗部中,水粉克洛特.红唇,水粉克洛特.黄唇,水粉克洛特.中唇,水粉克洛特.亮唇,水粉克洛特.深唇,水粉克洛特.拉丁黄,水粉克洛特.国美黄,水粉克洛特.里昂,水粉克洛特.臧氏黄,水粉克洛特.那波里黄,水粉克洛特.黄芥,水粉克洛特.秋叶,水粉克洛特.黄灰,水粉克洛特.橄榄灰,水粉克洛特.青芥,水粉克洛特.焦糖绿,水粉克洛特.国美绿,水粉米娅5号杯.赭石,水粉米娅5号杯.青莲,水粉米娅5号杯.钴蓝,水粉米娅5号杯.白色,水粉米娅5号杯.黑色,水粉米娅5号杯.桔黄,水粉米娅5号杯.朱红,水粉米娅5号杯.柠檬黄,水粉米娅5号杯.翠绿,水粉米娅5号杯.土黄,水粉米娅5号杯.中黄,水粉文萃.中黄,水粉文萃.桔黄,水粉文萃.土黄,水粉文萃.紫罗兰,水粉文萃.天蓝,水粉文萃.钴蓝,水粉文萃.湖蓝,水粉文萃.深绿,水粉文萃.中绿,水粉马利1100.柠檬黄,水粉马利1100.淡黄,水粉马利1100.中黄,水粉马利1100.桔黄,水粉马利1100.翠绿,水粉马利1100.墨绿,水粉马利1100.淡绿
水粉马利95.里昂,水粉马利95.晴朗蓝,水粉马利95.芥茉绿,水粉马利95.藕灰,水粉马利95.浅灰绿,水粉马利95.紫丁香,水粉马利95.浅绿灰,水粉马利95.砖灰,水粉马利95.碧蓝,水粉马利95.毛蓝,水粉马利95.月 灰,水粉马利95.匈牙利丁香,水粉马利95.象牙黄,水粉马利95.青苹果,水粉马利95.青频白,水粉马利95.紫薇色,水粉马利95.浅灰蓝,水粉马利95.淡咖啡,水粉马利95.红高粱,水粉温莎.柠檬黄,水粉温莎.白色,水粉温莎.大红,水粉温莎.桃红,水粉温莎.朱红,水粉温莎.深红,水粉温莎.玫瑰红,水粉温莎.桔红,水粉温莎.桔黄,水粉温莎.中黄,水粉温莎.淡黄,水粉温莎.土黄,水粉温莎.肉色,水粉温莎.浅那坡里黄,水粉温莎.牙黄,水粉温莎.普蓝,水粉温莎.天蓝,水粉温莎.群青,水粉温莎.,水粉青竹.闪电紫,水粉青竹.釉里红,水粉青竹.波尔多红,水粉青竹.茄紫,水粉青竹.匈牙利丁香,水粉青竹.国美红,水粉青竹.苏格兰红,水粉青竹.高粱红,水粉克洛特果冻.背景灰,水粉克洛特果冻.背景绿,水粉克洛特果冻.背景黄,水粉克洛特果冻.背景蓝,水粉克洛特果冻.暗部浅,水粉克洛特果冻.暗部中,水粉克洛特果冻.暗部深,水粉贝碧欧.生褐,水粉贝碧欧.熟褐,水粉贝碧欧.象牙黑,水粉贝碧欧.中灰,水粉贝碧欧.土红,水粉贝碧欧.黄灰,水粉贝碧欧.红灰,水粉贝碧欧.深红,水粉贝碧欧.粉红,水粉贝碧欧.紫罗兰,水粉贝碧欧.薰衣草紫,水粉贝碧欧.青莲,水粉贝碧欧.湖蓝,水粉贝碧欧.群青,水粉克洛特.高粱红,水粉克洛特.背景灰,水粉克洛特.补色青,水粉克洛特.补色绿,水粉克洛特.补色紫,水粉克洛特.补色蓝,水粉克洛特.暖发,水粉克洛特.冷发,水粉克洛特.灰发,水粉克洛特.黑色,水粉克洛特.白色,水粉克洛特.常青藤,水粉克洛特.起司,水粉克洛特.,水粉克洛特.马尔代夫,水粉克洛特.,水粉克洛特.爱琴海,水粉克洛特.,水粉克洛特.香水百合,水粉克洛特.,水粉克洛特.香苹果,水粉克洛特.,水粉克洛特.闪电紫,水粉克洛特.天蓝,水粉米娅5号杯.群青,水粉米娅5号杯.粉绿,水粉米娅5号杯.粉红,水粉米娅5号杯.熟褐,水粉米娅5号杯.黄绿,水粉米娅5号杯.灰色,水粉米娅5号杯.深黄,水粉米娅5号杯.肉色,水粉米娅5号杯.紫罗兰,水粉米娅5号杯.普兰,水粉米娅5号杯.墨绿,水粉文萃.桃红,水粉文萃.黄绿,水粉文萃.草绿,水粉文萃.橄榄绿,水粉文萃.翠绿,水粉文萃.淡绿,水粉文萃.粉绿,水粉文萃.墨绿,水粉文萃.普兰,水粉马利1100.黄绿,水粉马利1100.中绿,水粉马利1100.深绿,水粉马利1100.草绿,水粉马利1100.橄榄绿,水粉马利1100.钴蓝,水粉马利1100.湖蓝
水粉马利95.波斯菊,水粉马利95.深灰绿,水粉马利95.朝霞紫,水粉马利95.灰豆绿,水粉马利95.蓝莲,水粉马利95.酱紫,水粉马利95.浅米驼,水粉马利95.苏格兰红,水粉马利95.芽黄,水粉马利95.柿红,水粉马利95.豆绿,水粉马利95.咖啡,水粉马利95.嫩黄,水粉马利95.淡青灰,水粉马利95.淡妃,水粉马利95.浅蟹灰,水粉马利95.浅豆沙红,水粉马利95.,水粉马利95.,水粉温莎.中绿,水粉温莎.橄榄绿,水粉温莎.翠绿,水粉温莎.墨绿,水粉温莎.粉绿,水粉温莎.草绿,水粉温莎.黄绿,水粉温莎.钴蓝,水粉温莎.湖蓝,水粉温莎.粉蓝,水粉温莎.熟赭,水粉温莎.土红,水粉温莎.粉红,水粉温莎.洋红,水粉温莎.青莲,水粉温莎.熟褐,水粉温莎.浅驼,水粉温莎.黑色,水粉温莎.,水粉青竹.粉红,水粉青竹.墨绿,水粉青竹.波斯菊,水粉青竹.桃红,水粉青竹.香水百合,水粉青竹.桔红,水粉青竹.中绿,水粉青竹.橄榄绿,水粉克洛特果冻.补色绿,水粉克洛特果冻.补色青,水粉克洛特果冻.补色兰,水粉克洛特果冻.补色紫,水粉克洛特果冻.灰发,水粉克洛特果冻.冷发,水粉克洛特果冻.暖发,水粉贝碧欧.蓝灰,水粉贝碧欧.绿灰,水粉贝碧欧.玫瑰灰,水粉贝碧欧.粉绿,水粉贝碧欧.淡钴紫,水粉贝碧欧.肉色,水粉贝碧欧.灰豆绿,水粉贝碧欧.牙黄灰,水粉贝碧欧.淡青灰,水粉贝碧欧.米驼,水粉贝碧欧.浅蟹灰,水粉贝碧欧.蓝莲,水粉贝碧欧.豆沙红,水粉贝碧欧.月灰,水粉克洛特.芽黄灰,水粉克洛特.豆沙红,水粉克洛特.蓝莲,水粉克洛特.浅蟹灰,水粉克洛特.灰豆绿,水粉克洛特.米驼,水粉克洛特.淡青灰,水粉克洛特.月灰,水粉克洛特.雪青,水粉克洛特.青二,水粉克洛特.青三,水粉克洛特.青四,水粉克洛特.浅灰蓝,水粉克洛特.莱茵灰,水粉克洛特.风信子,水粉克洛特.橙棕,水粉克洛特.红棕,水粉克洛特.蟹青,水粉克洛特.兰灰,水粉克洛特.绿灰,水粉克洛特.蔷薇,水粉克洛特.国美兰,水粉克洛特.普罗旺斯,水粉克洛特.,水粉米娅5号杯.焦糖绿,水粉米娅5号杯.米驼,水粉米娅5号杯.月灰,水粉米娅5号杯.起司,水粉米娅5号杯.牙黄灰,水粉米娅5号杯.香苹果,水粉米娅5号杯.釉里红,水粉米娅5号杯.景德,水粉米娅5号杯.马尔代夫,水粉米娅5号杯.香水百合,水粉米娅5号杯.蔷薇,水粉文萃.群青,水粉文萃.,水粉文萃.灰色,水粉文萃.,水粉文萃.肉色,水粉文萃.,水粉文萃.牙黄,水粉文萃.,水粉文萃.青莲,水粉马利1100.黑色,水粉马利1100.熟褐,水粉马利1100.群青,水粉马利1100.紫色,水粉马利1100.天蓝,水粉马利1100.普蓝,水粉马利1100.青莲
水粉马利95.浅天蓝,水粉马利95.芽黄灰,水粉马利95.灰紫,水粉马利95.云尼拿,水粉马利95.茄灰,水粉马利95.景德,水粉马利95.波尔多红,水粉马利95.青灰,水粉马利95.高原黄,水粉马利95.玉灰,水粉马利95.浅棕灰,水粉马利95.爱琴海,水粉马利95.马尔代夫,水粉马利95.雪青,水粉马利95.浅黄灰,水粉马利95.蔷薇,水粉马利95.,水粉马利95.,水粉马利95.,水粉温莎.桔粉,水粉温莎.深蓝,水粉温莎.浅草绿,水粉温莎.浅绿,水粉温莎.茄紫,水粉温莎.淡灰,水粉温莎.灰色,水粉温莎.紫灰,水粉温莎.中灰,水粉温莎.绿灰,水粉温莎.砖灰,水粉温莎.粉绿灰,水粉温莎.淡咖啡,水粉温莎.孔雀石绿,水粉温莎.雪青,水粉温莎.金色,水粉温莎.银色,水粉温莎.,水粉温莎.,水粉青竹.青莲,水粉青竹.青竹蓝,水粉青竹.钴蓝,水粉青竹.天蓝,水粉青竹.群青,水粉青竹.翠绿,水粉青竹.肉色,水粉海特.春日青,水粉克洛特果冻.亮唇,水粉克洛特果冻.黄唇,水粉克洛特果冻.红唇,水粉克洛特果冻.中唇,水粉克洛特果冻.深唇,水粉克洛特果冻.钛白,水粉克洛特果冻.黑色,水粉贝碧欧.中绿,水粉贝碧欧.桃红,水粉贝碧欧.象牙黄,水粉贝碧欧.橙灰,水粉贝碧欧.紫灰,水粉贝碧欧.橙黄,水粉贝碧欧.珠光蓝,-,-,-,-,-,-,-,水粉克洛特.珍珠白,水粉克洛特.红二,水粉克洛特.红三,水粉克洛特.红四,水粉克洛特.红五,水粉克洛特.黄五,水粉克洛特.黄四,水粉克洛特.黄三,水粉克洛特.黄二,水粉克洛特.黄一,水粉克洛特.青五,水粉克洛特.蓝一,水粉克洛特.浣纱,水粉克洛特.挪威森林,水粉克洛特.四叶草,水粉克洛特.青花,水粉克洛特.国美红,水粉克洛特.锡兰,水粉克洛特.粉蓝,水粉克洛特.红葵,水粉克洛特.海芋,水粉克洛特.英伦,水粉克洛特.布林,水粉克洛特.波斯菊,水粉米娅5号杯.橄榄棕,水粉米娅5号杯.红灰,水粉米娅5号杯.淡妃,水粉米娅5号杯.橄榄灰,水粉米娅5号杯.咖啡,水粉米娅5号杯.国美绿,水粉米娅5号杯.英伦,水粉米娅5号杯.云尼拿,水粉米娅5号杯.松石,水粉米娅5号杯.紫薇,水粉米娅5号杯.拉丁黄,水粉文萃.赭石,水粉文萃.,水粉文萃.,水粉文萃.熟褐,水粉文萃.,水粉文萃.,水粉文萃.煤黑,水粉文萃.,水粉文萃.,水粉马利1100.金色,水粉马利1100.灰色,水粉马利1100.绿灰,水粉马利1100.红灰,水粉马利1100.浅灰,水粉马利1100.紫灰,水粉马利1100.黄灰
水粉马利95.氧化铬绿,水粉马利95.灰白,水粉马利95.亮红,水粉马利95.哈瓦那棕,水粉马利95.深蓝,水粉马利95.东方蓝,水粉马利95.浅钴蓝,水粉马利95.淡蓝,水粉马利95.生赭,水粉马利95.蓝紫,水粉马利95.,水粉马利95.深群青,水粉马利95.蓝绿,水粉马利95.绿松石蓝,水粉马利95.绿松石绿,水粉马利95.苔藓绿,水粉马利95.黑色,水粉马利95.,水粉马利95.,水粉温莎.豆黄灰,水粉温莎.浅灰紫,水粉温莎.,水粉温莎.浅灰蓝,水粉温莎.浅灰绿,水粉温莎.月灰,水粉温莎.赤土灰,水粉温莎.孔雀蓝,水粉温莎.荧光桃红,水粉温莎.荧光红,水粉温莎.荧光桔黄,水粉温莎.荧光黄,水粉温莎.荧光绿,水粉温莎.紫色,水粉温莎.,水粉温莎.,水粉温莎.,水粉温莎.,水粉温莎.,水粉海特.蓝莲,水粉海特.,水粉海特.米驼,水粉海特.,水粉海特.淡青灰,水粉海特.,水粉海特.牙黄灰,水粉海特.,水粉克洛特果冻.浅绿,水粉克洛特果冻.黄绿,水粉克洛特果冻.墨绿,水粉克洛特果冻.橄榄绿,水粉克洛特果冻.翠绿,水粉克洛特果冻.青频绿,水粉克洛特果冻.那波里黄,水粉克洛特果冻.湖蓝,水粉克洛特果冻.钴蓝,水粉克洛特果冻.天兰,水粉克洛特果冻.普兰,水粉克洛特果冻.粉蓝,水粉克洛特果冻.紫罗兰,-,-,-,-,-,-,-,-,水粉克洛特.黄绿五,水粉克洛特.黄绿四,水粉克洛特.黄绿三,水粉克洛特.黄绿二,水粉克洛特.黄绿一,水粉克洛特.肉黄五,水粉克洛特.肉黄四,水粉克洛特.肉黄三,水粉克洛特.肉黄二,水粉克洛特.肉黄一,水粉克洛特.蓝三,水粉克洛特.蓝二,水粉克洛特.紫一,水粉克洛特.紫二,水粉克洛特.紫三,水粉克洛特.紫四,水粉克洛特.紫五,水粉克洛特.草绿,水粉克洛特.维多利亚,水粉克洛特.云尼拿,水粉克洛特.炉均釉,水粉克洛特.臧氏蓝,水粉克洛特.加勒比,水粉克洛特.松石,水粉米娅5号杯.绿松石蓝,水粉米娅5号杯.桃红,水粉米娅5号杯.高粱红,水粉米娅5号杯.绿松石绿,水粉米娅5号杯.淡紫,水粉米娅5号杯.紫丁香,水粉米娅5号杯.国美黄,水粉米娅5号杯.国美红,水粉米娅5号杯.嫩黄,水粉米娅5号杯.牙黄,水粉米娅5号杯.青频绿,水粉文萃.柠檬黄,水粉文萃.,水粉文萃.,水粉文萃.那波里黄,水粉文萃.,水粉文萃.,水粉文萃.白色,水粉文萃.,水粉文萃.,水粉马利1100.棕灰,水粉马利1100.蓝灰,水粉马利1100.橙灰,水粉马利1100.白色,水粉马利1100.土黄,水粉马利1100.深红,水粉马利1100.赭石
水粉马利95.白色,水粉马利95.,水粉马利95.,水粉马利95.,水粉马利95.,水粉马利95.柠檬黄,水粉马利95.,水粉马利95.,水粉马利95.,水粉马利95.,水粉马利95.熟褐,水粉马利95.,水粉马利95.,水粉马利95.,水粉马利95.,水粉马利95.赭石,水粉马利95.,水粉马利95.,水粉马利95.,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,水粉海特.豆沙红,水粉海特.,水粉海特.灰豆绿,水粉海特.,水粉海特.月灰,水粉海特.,水粉海特.浅蟹灰,水粉海特.,水粉克洛特果冻.大红,水粉克洛特果冻.玫瑰红,水粉克洛特果冻.粉红,水粉克洛特果冻.桃红,水粉克洛特果冻.朱红,水粉克洛特果冻.深红,水粉克洛特果冻.桔红,水粉克洛特果冻.青莲,水粉克洛特果冻.灰色,水粉克洛特果冻.群青,水粉克洛特果冻.肉色,水粉克洛特果冻.熟褐,水粉克洛特果冻.赭石,-,-,-,-,-,-,-,-,水粉克洛特.橙一,水粉克洛特.橙二,水粉克洛特.橙三,水粉克洛特.橙四,水粉克洛特.橙五,水粉克洛特.绿一,水粉克洛特.绿二,水粉克洛特.绿三,水粉克洛特.绿四,水粉克洛特.绿五,水粉克洛特.蓝四,水粉克洛特.蓝五,水粉克洛特.,水粉克洛特.,水粉克洛特.,水粉克洛特.,水粉克洛特.,水粉克洛特.,水粉克洛特.,水粉克洛特.,水粉克洛特.,水粉克洛特.,水粉克洛特.,水粉克洛特.,水粉米娅5号杯.国美兰,水粉米娅5号杯.爱琴海,水粉米娅5号杯.蟹青,-,-,水粉米娅8号杯.柠檬黄,水粉米娅8号杯.拿坡里黄,水粉米娅8号杯.天蓝,水粉米娅8号杯.深红,水粉米娅8号杯.普兰,水粉米娅8号杯.橄榄绿,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-
-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,水粉克洛特果冻.土黄,水粉克洛特果冻.柠檬黄,水粉克洛特果冻.深黄,水粉克洛特果冻.嫩黄,水粉克洛特果冻.中黄,水粉克洛特果冻.桔黄,水粉克洛特果冻.淡黄,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,水粉米娅8号杯.钛白,水粉米娅8号杯.浅灰蓝,水粉米娅8号杯.珍珠白,水粉米娅8号杯.熟褐,水粉米娅8号杯.朱红,水粉米娅8号杯.淡黄,水粉米娅8号杯.桔红,水粉米娅8号杯.中黄,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-

丙烯油画区
油画温莎170.柠檬黄,油画温莎170.中黄,油画温莎170.淡黄,油画温莎170.土黄,油画温莎170.深黄,油画温莎170.深红,油画温莎170.朱红,油画温莎170.玫瑰莤红,油画温莎170.土红,油画温莎170.大红,油画马利170.肉色,油画马利170.土红,油画马利170.深红,油画马利170.大红,油画马利170.桔红,油画马利170.玫瑰红,油画马利170.朱红,油画马利170.淡黄,-,-,-,-,-,-,丙烯温莎300.湖蓝,丙烯温莎300.酞菁绿,丙烯温莎300.深青绿,丙烯温莎300.宝石翠绿,丙烯温莎300.沙普绿,丙烯温莎300.橄榄绿,丙烯贝碧欧500.钛白,丙烯贝碧欧500.亮白,丙烯贝碧欧500.钛黄,丙烯贝碧欧500.淡黄,丙烯贝碧欧500.镉柠檬黄,丙烯贝碧欧波普.金色,丙烯贝碧欧波普.银色,丙烯贝碧欧波普.深镉红,丙烯贝碧欧波普.朱红,-,丙烯青竹.桔红,丙烯青竹.深红,丙烯青竹.朱红,丙烯青竹.土黄,丙烯青竹.淡黄,丙烯青竹.珠光红铜,丙烯青竹.熟褐,丙烯青竹.生褐,丙烯马利.大红,丙烯马利.朱红,丙烯马利.桔红,丙烯马利.紫红,丙烯马利.深红,丙烯马利.土红,丙烯马利.草绿
油画温莎170.橙色,油画温莎170.那坡里黄,油画温莎170.紫罗兰,油画温莎170.群青,油画温莎170.基蓝,油画温莎170.酞菁蓝,油画温莎170.普蓝,油画温莎170.天蓝,油画温莎170.湖蓝,油画温莎170.钴蓝,油画马利170.马利绿,油画马利170.橄榄绿,油画马利170.朱砂中绿,油画马利170.镉绿,油画马利170.黄绿,油画马利170.中绿,油画马利170.深铬绿,油画马利170.草绿,-,-,-,-,-,-,丙烯温莎300.黄绿,丙烯温莎300.浅柠檬黄,丙烯温莎300.中黄,丙烯温莎300.橙色,丙烯温莎300.土黄,丙烯温莎300.桔红,丙烯贝碧欧500.基本黄,丙烯贝碧欧500.中镉黄,丙烯贝碧欧500.深镉黄,丙烯贝碧欧500.镉橙,丙烯贝碧欧500.镉红,丙烯贝碧欧波普.基本红,丙烯贝碧欧波普.基本黄,丙烯贝碧欧波普.柠檬黄,丙烯贝碧欧波普.中镉黄,-,丙烯青竹.,丙烯青竹.浅绿,丙烯青竹.翠绿,丙烯青竹.酞菁绿,丙烯青竹.,丙烯青竹.,丙烯青竹.,丙烯青竹.,丙烯马利.中黄,丙烯马利.柠檬黄,丙烯马利.淡黄,丙烯马利.土黄,丙烯马利.桔黄,丙烯马利.中绿,丙烯马利.粉绿
油画温莎170.熟褐,油画温莎170.肉色,油画温莎170.基黄,油画温莎170.碳黑,油画温莎170.橄榄绿,油画温莎170.中绿,油画温莎170.粉绿,油画温莎170.永固浅绿,油画温莎170.宝石翠绿,油画温莎170.维罗纳绿,油画马利170.柠檬黄,油画马利170.土黄,油画马利170.马利黄,油画马利170.中铬黄,油画马利170.深铬黄,油画马利170.那坡里黄,油画马利170.镉黄,油画马利170.桔铬黄,-,-,-,-,-,-,丙烯温莎300.马斯黑,丙烯温莎300.,丙烯温莎300.金色,丙烯温莎300.,丙烯温莎300.银色,丙烯温莎300.中灰,丙烯贝碧欧500.深镉红,丙烯贝碧欧500.喹丫啶酮猩红,丙烯贝碧欧500.亮基本红,丙烯贝碧欧500.亮粉红,丙烯贝碧欧500.深钴紫,丙烯贝碧欧波普.土黄,丙烯贝碧欧波普.镉橙,丙烯贝碧欧波普.那坡里黄,丙烯贝碧欧波普.钴蓝,-,丙烯克洛特.荧光妃红,丙烯克洛特.荧光桃红,丙烯克洛特.朱红,丙烯克洛特.玫瑰红,丙烯克洛特.大红,丙烯克洛特.深红,丙烯克洛特.橙色,-,丙烯马利.钴蓝,丙烯马利.湖蓝,丙烯马利.天蓝,丙烯马利.紫色,丙烯马利.群青,丙烯马利.酞菁蓝,丙烯马利.淡绿
油画温莎170.钛白,油画温莎170.,油画温莎170.锌钛白,油画温莎170.快干白,油画温莎170.生褐,油画温莎170.熟赭,油画温莎170.生赭,油画温莎170.金色,油画温莎170.银色,油画温莎170.青莲,油画马利170.印度黄,油画马利170.湖蓝,油画马利170.普蓝,油画马利170.天蓝,油画马利170.酞菁蓝,油画马利170.群青,油画马利170.钴蓝,油画马利170.紫罗兰,-,-,-,-,-,-,丙烯温莎300.大红,丙烯温莎300.永固红,丙烯温莎300.深红,丙烯温莎300.玫红,丙烯温莎300.玫瑰莤红,丙烯温莎300.朱红,丙烯贝碧欧500.绿松石蓝,丙烯贝碧欧500.镉绿,丙烯贝碧欧500.草绿,丙烯贝碧欧500.土绿,丙烯贝碧欧500.铬绿,丙烯贝碧欧波普.群青,丙烯贝碧欧波普.基本蓝,丙烯贝碧欧波普.霍克绿,丙烯贝碧欧波普.酞菁绿,-,丙烯克洛特.那波里黄,丙烯克洛特.土黄,丙烯克洛特.柠檬黄,丙烯克洛特.中黄,丙烯克洛特.起司,丙烯克洛特.香水百合,丙烯克洛特.青莲,-,丙烯马利.生褐,丙烯马利.熟褐,丙烯马利.威狄克棕,丙烯马利.赭石,丙烯马利.生赭,丙烯马利.佩恩灰,丙烯马利.灰色
油画温莎170.暖灰,油画温莎170.冷灰,油画温莎170.棕灰,油画温莎170.中灰,油画温莎170.培恩灰,油画马利170.,油画马利170.赭石,油画马利170.红灰,油画马利170.佩恩灰,油画马利170.粉绿,油画马利170.马斯黑,油画马利170.煤黑,油画马利170.翠绿,油画马利170.熟褐,油画马利170.深褐,油画马利170.生赭,油画马利170.生褐,油画马利170.马利紫,-,-,-,-,-,-,丙烯温莎300.桔黄,丙烯温莎300.那坡里黄,丙烯温莎300.浅赤土,丙烯温莎300.沙色,丙烯温莎300.肉色,丙烯温莎300.深黄,丙烯贝碧欧500.中灰,丙烯贝碧欧500.淡灰,丙烯贝碧欧500.深灰,丙烯贝碧欧500.冷灰,丙烯贝碧欧500.暖灰,丙烯贝碧欧波普.马斯黑,丙烯贝碧欧波普.熟褐,丙烯贝碧欧波普.荧光黄,丙烯贝碧欧波普.,-,丙烯克洛特.普蓝,丙烯克洛特.湖蓝,丙烯克洛特.酞菁蓝,丙烯克洛特.国美兰,丙烯克洛特.钴蓝,丙烯克洛特.天蓝,丙烯克洛特.熟褐,-,丙烯马利.钛白,丙烯马利.黑色,丙烯马利.酞菁绿,丙烯马利.翠绿,-,-,-
油画马利170.透明铁红,油画马利170.透明氧化铁棕,油画马利170.威狄克棕,油画马利170.透明黄,油画马利170.土紫,油画马利170.群青紫,油画马利170.浅红,油画马利170.透明铁黄,油画马利170.,油画马利170.,油画马利170.蓝灰,油画马利170.浅灰,油画马利170.橙灰,油画马利170.绿灰,油画马利170.深灰,油画马利170.黄灰,油画马利170.紫灰,油画马利170.棕灰,-,-,-,-,-,-,丙烯温莎300.群青,丙烯温莎300.土红,丙烯温莎300.熟褐,丙烯温莎300.熟赭,丙烯温莎300.生褐,丙烯温莎300.淡紫,丙烯贝碧欧500.天蓝,丙烯贝碧欧500.淡群青蓝,丙烯贝碧欧500.钴蓝,丙烯贝碧欧500.蓝绿,丙烯贝碧欧500.普蓝,-,-,-,-,-,丙烯克洛特.宝石翠绿,丙烯克洛特.橄榄绿,丙烯克洛特.粉绿,丙烯克洛特.酞菁绿,丙烯克洛特.浅绿,丙烯克洛特.黄绿,丙烯克洛特.熟赭,-,-,-,-,-,-,-,-
-,-,-,-,-,-,-,-,-,-,油画马利170.锌白,油画马利170.锌钛白,油画马利170.钛白,油画马利170.,油画马利170.,油画马利170.,油画马利170.,油画马利170.,丙烯温莎创意300.酞菁绿,丙烯温莎创意300.翠绿,丙烯温莎创意300.中绿,丙烯温莎创意300.熟褐,丙烯温莎创意300.金色,丙烯温莎创意300.亮金,丙烯温莎300.钛白,丙烯温莎300.,丙烯温莎300.浅绿,丙烯温莎300.天蓝,丙烯温莎300.浅灰蓝,丙烯温莎300.柠檬黄,丙烯贝碧欧500.赭石,丙烯贝碧欧500.泥土红,丙烯贝碧欧500.生褐,丙烯贝碧欧500.熟褐,丙烯贝碧欧500.佩恩灰,丙烯贝碧欧500.亮酞菁绿,丙烯贝碧欧500.那坡里黄,丙烯贝碧欧500.土黄,丙烯贝碧欧500.生赭,丙烯贝碧欧500.土红,丙烯克洛特.银色,丙烯克洛特.淡紫,丙烯克洛特.黑色,丙烯克洛特.钛白,-,-,-,-,-,-,-,-,-,-,-
-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,丙烯温莎创意300.深黄,丙烯温莎创意300.钴兰,丙烯温莎创意300.酞菁蓝,丙烯温莎创意300.湖蓝,丙烯温莎创意300.深绿,丙烯温莎创意300.群青,丙烯温莎300.紫色,丙烯温莎300.酞菁蓝,丙烯温莎300.普蓝,丙烯温莎300.钴蓝,丙烯温莎300.粉绿,丙烯温莎300.浅橄榄绿,丙烯贝碧欧500.透明朱红,丙烯贝碧欧500.莤草洋红,丙烯贝碧欧500.偶氮粉红,丙烯贝碧欧500.东方紫,丙烯贝碧欧500.深群青蓝,丙烯贝碧欧500.酞菁蓝,丙烯贝碧欧500.酞菁宝石翠绿,丙烯贝碧欧500.霍克绿,丙烯贝碧欧500.威尼斯黄,丙烯贝碧欧500.威尼斯红,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-
-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,丙烯温莎创意300.大红,丙烯温莎创意300.玫红,丙烯温莎创意300.玫莤,丙烯温莎创意300.柠檬黄,丙烯温莎创意300.土黄,丙烯温莎创意300.中黄,丙烯温莎300.青莲,丙烯温莎300.培恩灰,丙烯温莎300.象牙黑,丙烯温莎300.赤土色,丙烯温莎300.铜色,丙烯温莎300.青铜色,丙烯贝碧欧500.幻彩绿黄,丙烯贝碧欧500.幻彩蓝黑,丙烯贝碧欧500.淡偶氮黄,丙烯贝碧欧500.紫红,丙烯贝碧欧500.蔡洋红,丙烯贝碧欧500.幻彩橙黄,丙烯贝碧欧500.幻彩红蓝,丙烯贝碧欧500.幻彩紫蓝,丙烯贝碧欧500.幻彩蓝绿,丙烯贝碧欧500.幻彩绿蓝,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-
-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-,丙烯温莎创意300.熟赭,丙烯温莎创意300.钛白,丙烯温莎创意300.,丙烯温莎创意300.,丙烯温莎创意300.马斯黑,丙烯温莎创意300.,丙烯温莎300.荧光黄,丙烯温莎300.荧光桔黄,丙烯温莎300.荧光粉红,丙烯温莎300.荧光绿,丙烯温莎300.荧光桃红,丙烯温莎300.荧光蓝,丙烯贝碧欧500.马斯黑,丙烯贝碧欧500.深黑,丙烯贝碧欧500.荧光黄,丙烯贝碧欧500.荧光橙,丙烯贝碧欧500.荧光粉红,丙烯贝碧欧500.珠光银,丙烯贝碧欧500.珠光金,丙烯贝碧欧500.珠光金黄,丙烯贝碧欧500.珠光铜,丙烯贝碧欧500.,-,-,-,-,-,-,-,-,-,-,-,-,-,-,-''';
//}
  divs=new List<List<DivElement>>();
  top = querySelector("#top");
  top.className="top";
  top.style.display="inline";
  var store_view = new DivElement();
  store_view.id = "store_view";
  
  {
  store_areas_open_view=new DivElement();
  store_areas_open_view..id="areas_open"
      ..className="top";
  store_areas_open_view.style..display="flex"
      ..flexFlow="column";
  
  store_areas_view=new DivElement();
  store_areas_view.id="areas";
  store_areas_view.className="top";

  store_areas_open_view.onClick.listen(areas_open_click);
  store_areas_view.onClick.listen(areas_click);
  
  var areas_string=store_string.split('\n\n');
  var areas_count=areas_string.length;

  var areas_columns_count=areas_count~/8+1;
  for(var i=0;i<areas_rows_count;++i){
    var line_view=new DivElement();
    line_view.style..display="flex"
        ..flexFlow="row"
        ..flex="1";
    for(var j=0;j<areas_columns_count;++j){
      var cell=new ButtonElement();
      cell.style.flex="1";
      line_view.nodes.add(cell);
    }
    store_areas_open_view.nodes.add(line_view);
  }
  
  for (var area_no=0 ;area_no< areas_count;++area_no) {
    var area_string=areas_string.elementAt(area_no);
    
    var pos=area_string.indexOf("\n");
    var area_name = area_string.substring(0,pos);
    {
      var row=area_no~/areas_columns_count;
      var column=area_no%areas_columns_count;
      var line_view=store_areas_open_view.nodes.elementAt(row) as DivElement;
      var cell=line_view.nodes.elementAt(column) as ButtonElement;
      cell.text=area_name;
    }
    var table_string=area_string.substring(pos+1);
    
    var rows_string = table_string.split('\n');
    var rows_count = rows_string.length;
    
    var area_view =new DivElement();
    area_view.id=area_name;
    area_view.className="top";
    area_view.style
        ..overflow="scroll";
    for (var row = 0; row < rows_count; ++row) {
      var row_str = rows_string[row];
      
      var row_e = new DivElement();
      row_e.style..whiteSpace = "nowrap";
      var columns_str=row_str.split(",");
      var columns_count=columns_str.length;
      for (var column=0;column<columns_count;++column) {
        var column_str=columns_str.elementAt(column);
        var column_e = new ButtonElement();
        column_e.style
            ..width = "2.4em"
            ..height = "5.2em"
            ..whiteSpace = "normal"
            ..verticalAlign = "middle";
        if (column_str == "-") {
          column_e.text = "";
          column_e.disabled = true;
        } else {
          var pos = column_str.indexOf(".");
          var product_name=column_str.substring(pos+1);
          if(product_name==""){
            column_e.disabled = true;
          }
          column_e.text = product_name;
          column_e.className=column_str.substring(0, pos);
        }
        column_e.nodes.add(new BRElement());
        SpanElement span_e = new SpanElement();
        column_e.nodes.add(span_e);
        if(column>0){
          var t1=column_e.className;
          var t2=row_e.nodes.last.className;
          if(t1!=t2){
            column_e.style.borderLeftColor="rgb(255,0,0)";
          }
        }
        if(row>0){
          var t1=column_e.className;
          var t2=area_view.nodes.last.nodes.elementAt(column).className;
          if(t1!=t2){
            column_e.style.borderTopColor="rgb(255,0,0)";
          }
        }
        row_e.nodes.add(column_e);
      }
      area_view.nodes.add(row_e);
    }
    
    store_areas_view.nodes.add(area_view);
  }
  owners_product=new Map<String,Map<String,int>>();
  var owners_string=product_string.split("\n\n");
  var owners_count=owners_string.length;
  for(var owner=0;owner<owners_count;++owner){
    var owner_string=owners_string[owner];
    var pos=owner_string.indexOf("\n");
    if(pos!=-1){
      var owner_name = owner_string.substring(0,pos);
      var products_string=owner_string.substring(pos+1).split("\n");
      var products_count=products_string.length;
      var products =new Map<String,int>();
      for(var product=0;product<products_count;++product){
        var product_string=products_string[product];
        var pos=product_string.indexOf(" ");
        products[product_string.substring(0,pos)]=
            int.parse(product_string.substring(pos+1));
      }
      owners_product[owner_name]=products;
    }
  }

  store_take_stock_view = new DivElement();
  store_take_stock_view.className="top";
  store_take_stock_view.style
      ..flexFlow = "column";

  store_take_stock_product_view = new ButtonElement();
  store_take_stock_product_view.disabled = true;
  store_take_stock_product_view.style.height="3em";
  store_take_stock_num_view = new DivElement();
  store_take_stock_num_view.style
      ..display = "flex"
      ..flexFlow = "column"
      ..flex = "1";

  store_take_stock_num_view.onClick.listen(store_take_stock_num_click);
  var count = 0;
  for (var i = 0; i < 6; ++i) {
    var line = new DivElement();
    line.style
        ..display = "flex"
        ..flexFlow = "row"
        ..flex = "1";

    for (var j = 0; j < 5; ++j) {
      var e = new ButtonElement();
      e.text = count.toString();
      e.style..flex = "1";
      line.nodes.add(e);
      ++count;
    }
    store_take_stock_num_view.nodes.add(line);
  }
  var b=new ButtonElement();
  b.text="清除";
  b.style.height="6em";
  b.onClick.listen(clear);

  store_take_stock_view.nodes.add(store_take_stock_product_view);
  store_take_stock_view.nodes.add(store_take_stock_num_view);
  store_take_stock_view.nodes.add(b);
  
  store_view.nodes.add(store_areas_open_view);
  store_view.nodes.add(store_areas_view);
  store_view.nodes.add(store_take_stock_view);
  top.nodes.add(store_view);
  
  }

  window.onBeforeUnload.listen(before_unload);
  window.onUnload.listen(unload);
  querySelector("#store_open").onClick.listen(onStoreOpen);
  querySelector("#depot_open").onClick.listen(onDepotOpen);
  querySelector("#back").onClick.listen(onBack);
}

String before_unload(Event e) {
  return "退出？";
}
void unload(Event e) {
//  var areas_count=store_areas_view.nodes.length;
//  var areas_columns_count=areas_count~/areas_rows_count+1;
//  store_string="";
//  for(var area_no=0;area_no<areas_count;++area_no){
//    var area=store_areas_view.nodes[area_no];
//    if(area_no!=0){
//      store_string+="\n\n";
//    }
//    {
//      var row=area_no~/areas_columns_count;
//      var column=area_no%areas_columns_count;
//      var line_view=store_areas_open_view.nodes.elementAt(row) as DivElement;
//      var cell=line_view.nodes.elementAt(column) as ButtonElement;
//      cell.text=area_name;
//    }
//    store_string+=store_areas_open_view.nodes[i].
//    var rows_count=area.nodes.length;
//    for(var j=0;j<rows_count;++j){
//      store_string+="\n";
//      var row=area.nodes[j];
//      var columns_count=row.nodes.length;
//      for(var k=0;k<columns_count;++k){
//        if(k!=0){
//          store_string+=",";
//        }
//        var text=row.nodes[k].firstChild.text;
//        if(text==""){
//          store_string+="-";
//        }else{
//          store_string+=text;
//        }
//      }
//    }
//  }
//  local_storage["商店"]=store_string;
}
void top_click(Event e) {
}
void store_take_stock_num_click(Event e) {
  ButtonElement num_e = e.target as ButtonElement;
  var num = int.parse(num_e.text);
  var t=num;
  var p=owners_product[owner_name];
  if(p!=null){
    var n=p[product_name];
    if(n!=null){
      t=n-t;
    }
  }
  var span = product.querySelector("span");
  if (t != 0) {
    span.text = t.toString();
    span.style
        ..color = "#fff"
        ..backgroundColor = "#dd524d"
        ..display = "inline-block"
        ..lineHeight = "1"
        ..borderRadius = "0px"
        ..padding = "0px 0px";
  } else {
    span.style.display = "none";
  }
  back();
}
void areas_open_click(Event e){
  ButtonElement n = e.target as ButtonElement;
  var str=n.text;
  if(str!=""){
    var n2=querySelector("#areas") as DivElement;
    n2.style.display="inline";
    var nn=querySelector("#"+str) as DivElement;
    nn.style.display="inline";
    
    var l=new List<DivElement>();
    l.add(n2);
    l.add(nn);
    divs.add(l); 
  }
}
void areas_click(Event e) {
  var l=new List<DivElement>();
  l.add(store_take_stock_view);
  divs.add(l);
  
  store_take_stock_view.style.display = "flex";
  if (e.target is ButtonElement) {
    product = e.target as ButtonElement;
  } else if (e.target is SpanElement) {
    var elem = e.target as SpanElement;
    product = elem.parent as ButtonElement;
  }
  owner_name=product.className;
  product_name=product.nodes.first.text;
  store_take_stock_product_view..text = product.text;
}
void onStoreOpen(Event e) {
}
void onDepotOpen(Event e) {
}

void onBack(Event e){
  back();
}
void back(){
  if(divs.length>0){
    var l=divs.last;
    for(var e in l){
      e.style.display="none";
    }
    divs.removeLast();
  }
}
void clear(Event e){
  var span = product.querySelector("span");
  span.style.display = "none";
  back();
}

